{
  "translate-the-epub-book-using-llm-side-by-side": "Use LLM to translate EPUB e-books. The translated book will retain the original text and display the translation alongside the original text.",
  "books-translator": "Books Translator",
  "books-translator1": "Books Translator",
  "use-llm-to-translate-epub-e-books-the-translated-book-will-retai": "Use LLM to translate EPUB e-books. The translated book will retain the original text and display the translation alongside the original text.",
  "playground": "Playground",
  "translate-a-book-1": "Translate a book #1",
  "comment:+comment-1751874375575:title": "Main fields",
  "comment:+comment-1751874375575:content": "In most cases, you only need to configure these three fields to run everything properly.\n- `source_file`: The original EPUB file to be translated\n- `translated_file`: The location to save the translated EPUB file (if left blank, it will be saved in `session_dir`)\n- `language`: The target language for the translation",
  "comment:+comment-1751874833250:title": "Custom prompt",
  "comment:+comment-1751874833250:content": "The `prompt` field can be filled with prompts to provide necessary information for the LLM to translate books. For example, you can enter standardized glossaries and character names. Simply describe and inform the LLM in natural language.",
  "comment:+comment-1751874949570:title": "Output field",
  "comment:+comment-1751874949570:content": "`translated_file` The save path of the translated file.",
  "comment:+comment-1751875005817:title": "extra field",
  "comment:+comment-1751875005817:content": "If you do not wish to modify the following fields, simply keep their original values.\n\n- `max_chunk_tokens`: When translating in segments, this limits the maximum number of tokens per segment. Due to the nature of LLMs, it is impossible to input an entire book into a large language model for translation at once. Therefore, the book will be divided into segments and submitted to the LLM. This parameter is used to limit the maximum length of each segment (measured in tokens).\n- `threads`: The number of concurrent translation requests. If you feel the translation is too slow, you can increase this value. However, it is recommended not to exceed 16 concurrent threads, as this may trigger rate limiting by the LLM provider.\n- `retry_times`: The number of consecutive failures for the same segment before declaring it a failure.\n- `retry_interval_seconds`: The number of seconds to wait before retrying after a failed attempt.",
  "comment:+comment-1751875472639:title": "Interrupted interpretation",
  "comment:+comment-1751875472639:content": "When translating the same book, if you actively interrupt the process or it is interrupted due to network issues, the progress you have made will not be lost. After clicking \"Run\" to continue, you can resume translating from where you left off last time.",
  "translate-a-book": "Translate a book",
  "use-llm-to-translate-epub-ebooks-the-translated-book-will-retain": "Use LLM to translate epub ebooks. The translated book will retain the original text and list the translation side by side with the original text.",
  "the-original-epub-file-to-be-translated": "The original EPUB file to be translated",
  "the-saved-path-of-the-translated-epub-file-if-not-filled-in-spec": "The saved path of the translated EPUB file. If not filled in, specify an path.",
  "translation-target-language": "Translation target language",
  "how-is-the-translation-written-into-an-epub-file-is-it-append-to": "How is the translation written into an EPUB file: Is it \"append\" to the original text? Or does it \"replace\" the original text?",
  "provide-llm-with-necessary-information-for-translating-books-for": "Provide LLM with necessary information for translating books. For example, you can fill in the glossary and character name specifications. Just tell LLM with natural language description.",
  "the-entire-book-will-be-split-into-many-chunks-and-submitted-to": "The entire book will be split into many chunks and submitted to LLM in batches. this number is used to limit the number of tokens in each chunk.",
  "the-number-of-threads-opened-at-the-same-time-to-initiate-reques": "The number of threads opened at the same time to initiate requests to LLM, the more threads, the faster the analysis speed.",
  "the-number-of-retries-after-an-llm-request-fails-is-limited-if-a": "The number of retries after an LLM request fails is limited. If a request exceeds this number, an error will be reported and the request will be exited.",
  "how-long-in-seconds-after-a-failed-llm-request-starts-the-next-r": "How long (in seconds) after a failed LLM request starts the next retry",
  "display-name3": "Book translator",
  "description3": "Use LLM to translate EPUB e-books, while retaining the original text and the translated text, to achieve a bilingual reading experience.",
  "translated-epub-file-path": "EPUB file path has been translated."
}
